//=======================================================================================================================================================================================================================================================
/**
 * * Добавляет класс при прокручивании(вверх и вниз(больше чем высота шапки))
 * ! Если переменная {@link _header.stk} ровна false тогда прекращает работу
 * При форме sticky к body добавляется .js_s-sticky
 */
//=======================================================================================================================================================================================================================================================
import {throttle} from "../exports/lodash.js";
import _header from "../exports/header.js";
import _dom from "../exports/dom.js";
//=======================================================================================================================================================================================================================================================
let newScrollPosition = scrollY;
let lastScrollPosition;
throttle("scroll", 500, function () {
   if (!_header.stk) return;

   lastScrollPosition = scrollY;

   if (newScrollPosition < lastScrollPosition && scrollY > _header.h) _dom.el.add("sticky"); // При прокрутке вниз и если прокручено больше чем высота шапки
   else _dom.el.del("sticky"); // При прокрутке вверх

   newScrollPosition = lastScrollPosition;
});
//=======================================================================================================================================================================================================================================================