//=======================================================================================================================================================================================================================================================
import module from "../../src/js/modules/resize.js";
//=======================================================================================================================================================================================================================================================
jest.useFakeTimers();

describe("Тестирование resize", () => {
   test("resizeTimer не определен", () => expect(module.__get__("resizeTimer")).toBeUndefined());
   test("Срабатывает при событии", () => {
      dispatchEvent(new Event("resize")); // Вызвать события
      expect(document.body.classList.contains("js_s-resize")).toBeTruthy();
      jest.runAllTimers();
      expect(document.body.classList.contains("js_s-resize")).toBeFalsy();
      expect(module.__get__("resizeTimer")).not.toBeUndefined();
   });
});
//=======================================================================================================================================================================================================================================================