//=======================================================================================================================================================================================================================================================
import _number from "../../src/js/exports/number.js";
//=======================================================================================================================================================================================================================================================
describe("Тестирование _number", () => {
   test("Случайное число больше или равно 2 и меньше или равно 12", () => {
      const randomNumber = _number.random(2, 12);

      expect(randomNumber).toBeGreaterThanOrEqual(2);
      expect(randomNumber).toBeLessThanOrEqual(12);
   });
   describe("round", () => {
      test("Число 8.875274 округляется до десяти тысячных", () => expect(_number.round(8.875274, 4)).toBe(8.8753));
      test("Число 2.987654 округляется до десяти тысячных в меньшую сторону", () => expect(_number.round(2.987644, 4, 1)).toBe(2.9876));
      test("Число 3.012345 округляется до десяти тысячных в большую сторону", () => expect(_number.round(3.012345, 4, 2)).toBe(3.0124));
   });
   test("Вернуть делимое число для 99", () => expect(_number.divide(99, 51)).toBe(102));
   describe("prc", () => {
      test("Получить часть 111 от 291", () => expect(_number.prc(111, 291, true)).toBe(0.38144329896907214));
      test("Получить процент 494 от 666", () => expect(_number.prc(494, 666, false)).toBe("74.1742%"));
   });
   test("Конвертировать 31(px) в REM", () => expect(_number.rem(31)).toBe("1.9375rem"));
   test("Сохранить 210(px) относительно REM", () => {
      document.body.style.fontSize = "20px"; // Немного увеличить размер шрифта
      expect(_number.keepRem(210)).toBe(262.5);
      document.body.style.fontSize = "16px"; // Вернуть значение по умолчанию
   });
   describe("dc", () => {
      test("Динамически посчитать значение при ширине меньше", () => {
         window.innerWidth = window.g.DESIGN_WIDTH / 2; // Изменить ширину
         expect(_number.dc(20, 14)).toBeLessThan(20);
      });
      test("Динамически посчитать значение при ширине больше", () => {
         window.innerWidth = window.g.DESIGN_WIDTH * 2; // Изменить ширину
         expect(_number.dc(22, 18)).toBeGreaterThan(22);
      });
      test("Первый аргумент соответствует динамическому подсчету", () => {
         window.innerWidth = window.g.DESIGN_WIDTH; // Изменить ширину
         expect(_number.dc(24, 18)).toBe(24);
      });
      test("Второй аргумент соответствует динамическому подсчету", () => {
         window.innerWidth = window.g.MIN_WIDTH; // Изменить ширину
         expect(_number.dc(22, 14)).toBe(14);
      });
   });
   test("Конвертировать 150 из диапазона 0 - 300 в диапазон 0 - 5", () => expect(_number.convertRange(150, ...[0, 300], ...[0, 5])).toBe(2.5));
});
//=======================================================================================================================================================================================================================================================