//=======================================================================================================================================================================================================================================================
import nodePath from "path";
//=======================================================================================================================================================================================================================================================
/** Путь к скомпилированной папке */
const distF = "./dist";
/** Путь к папке с исходниками */
const srcF = "./src";
/** Путь к папке с временными файлами */
const tempF = "./tmp";
//=======================================================================================================================================================================================================================================================
const path = {
   rootF: nodePath.basename(nodePath.resolve()).match(/[A-Z]{2,}(?=[A-Z][a-z]+[0-9]*|\b)|[A-Z]?[a-z]+[0-9]*|[A-Z]|[0-9]+/g).map(x => x.toLowerCase()).join("-"),
   distF: distF,
   srcF: srcF,
   clean: [tempF, distF], // Папки для очистки
   ftp: "www/mister-corvo.com/www",
   ftpRoot: "www",
   dist: { // Пути к скомпилированным файлам
      html: `${distF}/`,
      css: `${distF}/css/`,
      js: `${distF}/js/`,
      php: `${distF}/php/`,
      img: `${distF}/img/`,
      ico: `${distF}/img/favicon/`,
      fonts: `${distF}/fonts/`,
      icoOpts: `${tempF}/favicon.json`,
   },
   src: { // Пути к исходникам
      files: [`${srcF}/files/**/*.*`, `${srcF}/files/**/.*`, `${srcF}/files/**/*.`, `${srcF}/files/**/*`],
      html: `${srcF}/html/*.html`,
      scss: `${srcF}/scss/*.scss`,
      js: `${srcF}/js/*.js`,
      php: `${srcF}/php/*.php`,
      img: `${srcF}/img/**/*.`,
      ico: `${srcF}/img/favicon/favicon.png`,
      fonts: `${srcF}/fonts/`
   },
   watch: { // Пути к наблюдаемым файлам
      files: [`${srcF}/files/**/*.*`, `${srcF}/files/**/.*`, `${srcF}/files/**/*.`, `${srcF}/files/**/*`],
      html: `${srcF}/html/**/*.{html,json}`,
      scss: `${srcF}/scss/**/*.scss`,
      js: `${srcF}/js/**/*.js`,
      php: `${srcF}/php/**/*.php`,
      img: `${srcF}/img/**/*.{jpg,jpeg,png,svg,gif,ico,webp}`,
   }
};
//=======================================================================================================================================================================================================================================================
export default path;
//=======================================================================================================================================================================================================================================================