//=======================================================================================================================================================================================================================================================
import _dom from "./dom.js";
//=======================================================================================================================================================================================================================================================
/**
 * Управление блокировки прокрутки
 * @namespace
 * @property {boolean} isProperty {@link _lock.is} Заблокирована ли прокрутка основного контента
 * @property {Function} remove {@link _lock.remove} Удалить блокировку
 * @property {Function} add {@link _lock.add} Добавить блокировку
 * @property {Function} toggle {@link _lock.toggle} Удалить/Добавить блокировку
 */
const _lock = {};
/**
 * Заблокирована ли прокрутка основного контента
 * @type {boolean}
 */
_lock.is = false;
/**
 * Удалить блокировку прокрутки основного контента
 * @param {number} delay Задержка
 */
_lock.remove = function (delay) {
   if (_lock.is) return;

   setTimeout(() => {
      document.body.style.setProperty("--lp", 0);
      _dom.el.del("lock");
   }, delay);

   _lock.is = true;
   setTimeout(() => _lock.is = false, delay);

};
/**
 * Добавить блокировку прокрутки основного контента
 * @param {number} delay Задержка
 */
_lock.add = function (delay) {
   if (_lock.is) return;

   document.body.style.setProperty("--lp", innerWidth - document.body.offsetWidth + "px");
   _dom.el.add("lock");

   _lock.is = true;
   setTimeout(() => _lock.is = false, delay);
};
/**
 * Удалить/Добавить блокировку прокрутки основного контента
 * (Проверяет есть ли блокировка и вызывает подфункции)
 * @param {number} delay Задержка
 */
_lock.toggle = delay => (_dom.el.has("lock")) ? _lock.remove(delay) : _lock.add(delay);
//=======================================================================================================================================================================================================================================================
export default _lock;
//=======================================================================================================================================================================================================================================================